Revit 2027 API
Revolution.EndAngle Property
The end angle of the revolution relative to the sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndAngle { get; set; }
Public Property EndAngle As Double
	Get
	Set
public:
property double EndAngle {
	double get ();
	void set (double value);
}
member EndAngle : float with get, set
Property Value
Double
Remarks
The direction of the angle is based on the normal of the sketch plane. A positive angle is on the same side as the normal, a negative angle on the opposite side.
See Also
Reference
Revolution Class
Autodesk.Revit.DB Namespace